[
    {
        "title": "Del Secco Diamond Drilling",
        "projectLink": "https://delseccosite.web.app/",
        "githubLink": "",
        "mediaLinks": [],
        "summary": "My first major project was the total redesign of Del Secco Diamond's website and to make it mobile friendly. <br><br> I transferred all the data from the previous site and created a new one from the ground up. I used Firebase to host the website and made use of its database functionality so the clients could upload entries for their construction projects and services in the admin console without me needing to hardcode the data into the html. I also made use of Firebase's cloud functions to implement the ability for users to send emails to the client in-site using the SendGrid API. <br><br> Through this project I learned a lot about website development at every level. I had to do research on color theory to choose a color scheme and determine how to lay out pages. I also learned a lot about Firebase and all the services it provides for developers such as authentication and its databases. Beyond gaining programming experience I learned how to work with a client and got a chance to put into action the software engineering principles I learned at UCI."
    },
    {
        "title": "Python Webcrawler",
        "projectLink": "",
        "githubLink": "https://github.com/jacobs0925/crawler",
        "mediaLinks": [],
        "summary": "I worked on this webcrawler as a part of my Search Engine class at UCI in my senior year. The task was to take some uncompleted code and add a function to scrape through all of the pages on UCI's domain and create a command line interface to search for words scraped. <br><br> Some major problems we needed to overcome were large and repetitive files with no information of value as well as webtraps design to halt our crawlers. I did this using the Simhash algorithm which created a hash of the tokens and frequencies on each page and created a 32 bit fingerprint of it. These fingerprints were stored in a map for fast lookup time and pages with a high similarity to previous ones could be skipped going forward. <br><br> Since this was meant to also have search functionality, we needed methods to quickly iterate over the indexed pages that were loaded and unloaded from memory. I stored blocks of indexed data in equal sized chunks with an index file so the search engine could quickly tell if a relevant word was stored in the chunk. This was still slow however so it was recommended to me by a TA that I perform consolidations of chunks so there was less data on the disk and lookup times could be quicker. The searching was done using Cosine Similarity which used vectors of tokens and their inverse term frequently to choose the most relevant documents in the corpus."
    },
    {
        "title": "Autonomous Shopping Cart",
        "projectLink": "",
        "githubLink": "https://github.com/jacobs0925/ShoppingCart",
        "mediaLinks": [
            "./cart3.jpg",
            "./cart1.png",
            "./cart2.png",
            "./cart-diagram.png"
        ],
        "summary": "For my senior project I worked with a team of 3 other engineers to create an autonomous shopping cart. The project was meant to solve the pain point of carts being stolen or left in a parking lot with minimal effort needed from users. I was in charge of software development and contributed to the wiring and design of the cart as well. <br><br> The code was written in Python and utilized infrared sensors to follow a line that would theoretically be placed on the floor of a convenience store. Additionally it had an ultrasonic sensor to avoid collisions with bystanders as well as monitor the velocity of the cart.<br><br> I learned a lot about the engineering process as well as the importance of teamwork throughout this project. My team and I went through many design iterations and did continuous testing until we found a design that worked most efficiently. I was grateful to work in a team with many different skillsets and to rely on them when I wasn't sure what the next step would be. You can click <a target='_blank' class='link-class' href='Final_Report_Smart_Shopping_Cart.docx.pdf'>HERE</a> to view our report."
    },
    {
        "title": "Crux Programming Language",
        "projectLink": "",
        "githubLink": "",
        "mediaLinks": [],
        "summary": "In my programming language class, we were tasked with developing a new programming language called crux. The professor provided much of the functionality and definitions of symbols used but it was on us to add all of the logic to the language parser. <br><br> It used ANTLR to parse the grammar of the language using the visitor programming pattern creating different types of trees that would model the language. The Abstract Syntax Tree or AST was a tree that showed how symbols would be arranged, for example x = 1 + 1 would have integers 1 and 1 at the bottom with an addition operation as a parent that would then be assigned to its parent, the variable x. We then implemented type checking and code for the intermediate representation which dictated the execution path our program might take. Finally, we added machine code generation which turned these previous representations into actual machine code to be run. <br><br> Unfortunately, I cannot provide the repository as it could be used by other students going forward but would be happy to discuss further or show my repo in person."
    },
    {
        "title": "Streaming Site",
        "projectLink": "https://telepartyclone.web.app/PlayerView.html",
        "githubLink": "https://github.com/jacobs0925/Teleparty/tree/dev",
        "mediaLinks": [
            "./github.png",
            "./headshot.png",
            "./linkedin.png"
        ],
        "summary": "Since graduating my girlfriend and I have been less able to watch movies together and the software we were using to watch shows together only worked on Netflix. I decide to create my own version, a website where users could create parties with friends and watch content in sync as well as chat together. <br><br> The project is currently under development. It is hosted on firebase and makes use of auth and database features to securely store user data. Eventually I plan to use Firebase Cloud Functions to incorporate the python code from my webcrawler project and allow for users to search the web for media they wish to stream. Feel free to visit the site and try out some user features, currently parties can be created and friend requests and friends can be managed. There is only a placeholder video at the moment but that will change once the user experience is completed."
    }
]